Revit 2026 API

# PartUtilsCreateParts(Document, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void CreateParts(
	Document document,
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Sub CreateParts (
	document As Document,
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
static void CreateParts(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member CreateParts :
        document : Document *
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

document Document

elementIds ICollectionElementId

#### Reference

PartUtils Class

CreateParts Overload

Autodesk.Revit.DB Namespace